{"keras_version": "1.1.1", "config": [{"config": {"name": "convolution2d_1", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "bias": true, "nb_col": 3, "batch_input_shape": [null, 96, 96, 1], "activity_regularizer": null, "activation": "linear", "trainable": true, "input_dtype": "float32", "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_row": 2, "bias": true, "nb_col": 2, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_row": 2, "bias": true, "nb_col": 2, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 128, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 500, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 500, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_3", "bias": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 30, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}