{"config": [{"config": {"trainable": true, "nb_col": 3, "activation": "linear", "border_mode": "valid", "batch_input_shape": [null, 96, 96, 1], "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "input_dtype": "float32", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_1", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.1, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "nb_col": 2, "activation": "linear", "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 2, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_2", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "nb_col": 2, "activation": "linear", "border_mode": "valid", "nb_filter": 128, "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 2, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_3", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.3, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "linear", "output_dim": 1000, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "linear", "output_dim": 1000, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "output_dim": 30, "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}