{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 100, "input_dim": 9216, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 9216], "b_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 30, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear"}}]}