{"config": [{"config": {"activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_1", "trainable": true, "activity_regularizer": null, "input_dtype": "float32", "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "batch_input_shape": [null, 96, 96, 1]}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "bias": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_row": 2, "nb_col": 2, "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "bias": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_row": 2, "nb_col": 2, "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "nb_filter": 128, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_constraint": null, "name": "dense_1", "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 500, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "name": "dense_2", "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 500, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "name": "dense_3", "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 30, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}