{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "bias": true, "input_dtype": "float32", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "batch_input_shape": [null, 96, 96, 1], "W_regularizer": null, "nb_filter": 32, "nb_col": 3, "activation": "linear", "name": "convolution2d_1", "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.1, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 2, "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_col": 2, "nb_filter": 64, "name": "convolution2d_2", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 2, "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_col": 2, "nb_filter": 128, "name": "convolution2d_3", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.3, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 500, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 500, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 30, "trainable": true, "input_dim": null, "activation": "linear", "name": "dense_3", "W_regularizer": null, "init": "glorot_uniform"}}]}