{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 9216], "output_dim": 100, "input_dim": 9216, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "name": "dense_1", "bias": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 30, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "name": "dense_2", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null}}]}