{"keras_version": "1.1.1", "config": [{"config": {"subsample": [1, 1], "name": "convolution2d_1", "input_dtype": "float32", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 96, 96, 1], "border_mode": "valid", "nb_filter": 32, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "W_regularizer": null, "trainable": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "name": "convolution2d_2", "nb_row": 2, "nb_col": 2, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "W_regularizer": null, "trainable": true, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 128, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "name": "convolution2d_3", "nb_row": 2, "nb_col": 2, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 500, "activation": "linear", "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 500, "activation": "linear", "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 30, "activation": "linear", "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}