{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "batch_input_shape": [null, 96, 96, 1], "input_dtype": "float32", "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "nb_filter": 32, "b_constraint": null, "name": "convolution2d_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.1, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 2, "activity_regularizer": null, "nb_row": 2, "b_constraint": null, "name": "convolution2d_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "nb_filter": 128, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 2, "activity_regularizer": null, "nb_row": 2, "b_constraint": null, "name": "convolution2d_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1000, "name": "dense_1", "b_constraint": null, "input_dim": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1000, "name": "dense_2", "b_constraint": null, "input_dim": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "name": "dense_4", "b_constraint": null, "input_dim": null, "trainable": true}}]}