{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 3, "init": "glorot_uniform", "trainable": true, "batch_input_shape": [null, 96, 96, 1], "dim_ordering": "tf", "nb_row": 3, "border_mode": "valid", "bias": true, "input_dtype": "float32", "nb_filter": 32, "activity_regularizer": null, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 2, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_row": 2, "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_col": 2, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "bias": true, "nb_row": 2, "nb_filter": 128, "activity_regularizer": null, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "trainable": true, "input_dim": null, "b_constraint": null, "output_dim": 500, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "trainable": true, "input_dim": null, "b_constraint": null, "output_dim": 500, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "trainable": true, "input_dim": null, "b_constraint": null, "output_dim": 30, "bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}]}