{"config": [{"config": {"activation": "linear", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 9216, "name": "dense_1", "batch_input_shape": [null, 9216], "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "b_constraint": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 30}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}