{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "input_dtype": "float32", "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 96, 96, 1], "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "trainable": true, "activation": "linear", "nb_filter": 32, "bias": true, "nb_row": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.1}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "trainable": true, "nb_row": 2, "nb_filter": 64, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "trainable": true, "nb_row": 2, "nb_filter": 128, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "output_dim": 1000, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "output_dim": 1000, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "output_dim": 30, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "bias": true, "W_regularizer": null}}]}